clases/analisis.tex
% Created 2020-12-06 dom 15:49
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{book}
	   \input{/home/jhonny/git/LaTeX-University/preamble-book.tex}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{amssymb}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{textcomp}
\usepackage{capt-of}
\author{Jhonny Lanzuisi}
\date{\today}
\title{Análisis}
\hypersetup{
 pdfauthor={Jhonny Lanzuisi},
 pdftitle={Análisis},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents


\part{Conjuntos de números}
\label{sec:org2658083}

\chapter{Reales y racionales}
\label{sec:orgea67cd8}
Definimos los reales usando las cotas superiores (o inferioes) mínimas (o máximas).
Esto es:

\begin{definition}
Sea \(A\) un conjunto y \(X\) un subconjunto de \(A\).
Un elemento \(b\in A\) es una \emph{cota superior} si \(b\geq x\) para todo \(x\in X\).
\end{definition}

\section{Una prueba}
\label{sec:orgad4c69c}
Esto, junto con:

\begin{definition}
Un elemento \(b\in A\) es una cota superior mínima, o \emph{supremo}, si
para toda cota superior \(b'\) de \(X\) se tiene que \(b\leq b'\).
\end{definition}

Nos permite definir los reales de la siguiente forma:

\begin{definition}
Existe un cuerpo ordenado, que contiene a \(\mathbb{Q}\),
con la propiedad de que todo conjunto acotado (no vacío) superiormente tiene supremo.
A este conjunto lo llamamos \(\mathbb{R}\), los reales.
\end{definition}

Al giual que con las otras dos definiciones, 
se puede dar una definición análoga de los reales usando ínfimos.

Esto es otro parrafo de prueba hehehe
\end{document}